Repository: necrose99/Myaamia
Catalog: Word-List-Dictionary/sac_GOLD.tmx
Source language: en_us
Languages: sac

source: p an.
sac: ahkwâwishimêwa fill u

source: snarl;
sac: âhkwâpitêwishimowa

source: atwrap
sac: ahkwichipîthehkâhi co ahpahôni (woman’s) hair

source: I’m P
sac: netahpenîtho Potato clan;

source: ) potm
sac: ahpenya ahpenyêki (pl.: akikwâha phleg

source: TIONA
sac: 22 A C D ONCISE IC

source: an.
sac: akimêwa count

source: inan.
sac: akitamwa count

source: nthook
sac: akitâthowa cou akôchikani pot

source: (châhi) k âkwi mâne êkôhmuch
sac: âkwi

source: 23 E
sac: S L OF THE AUK ANGUAG

source: be a netamehk memberwitho I’
sac: amehkwithowa

source: be alert, qu âmi- ick to reatâni uld;
sac: amêthiwa

source: ow woulnd it?
sac: âmishimehkamâni? h get there?, how could I fi

source: ahtôwacancer
sac: amokwîweni cancer; amokwîweni (s)he has

source: dish, bowwathi
sac: anâkani nâkani (or ) anâkowe â yesterday;

source: ’t worry!
sac: ânemitêhêhkani! don

source: 25 E
sac: S L OF THE AUK ANGUAG

source: American,
sac: Anenôtêwa a Native

source: a dip; takho
sac: anenwîwa bathe, take Anêpahôha an Arapa

source: , record inite
sac: anepyêhamwa write anepyêhâthowa wr

source: ay, way ofet lost!;
sac: anika away, further aw anika’hâno! get out!, g

source: âhi ) waycan’t
sac: anikâ’nâhi nikô’n (or ashkachi- be impatient to,

source: (pl. :
sac: athâwochêpihki

source: carrotmoccasin
sac: athâwochêpihkyêni ) athayimahkethêhi

source: hi? can y
sac: kekashkathemi help!;

source: ! please h
sac: kîhathemihi help me?;

source: ’ll help y
sac: kîhathemihene me!; I

source: ARY
sac: 30 A C D ONCISE ICTION

source: out, lendi ) rock, s
sac: athemihiwêwa help atheni athenyên (pl.:

source: lyall nose
sac: châki châki- , all, complete chakikomêwa have a sm

source: ANGUA
sac: S L OF THE AUK

source: befored)
sac: êyêhpwâwi- Conjunctive moo

source: mkay
sac: êyênîha possu haw all right, o

source: upperkâta
sac: -hkâhki chest, -hkâchi -h (pl.:

source: (p -ht l.:
sac: -htawakayi

source: what
sac: hwa? wa? (or )

source: ICTIONARY
sac: 38 A C D ONCISE

source: sses dismayeg.) go the
sac: î! oh no! (expre ihêwa â/ê ( ; irr

source: owîh iend;
sac: kîhkâna your fr

source: nîhkâne!
sac: his/her friend(s);

source: y friends!
sac: nîhkânetike! m

source: thatihkwê an;
sac: ihketowa say ihkwêwa wom

source: ladies!
sac: ihkwêwetike! )

source: nîki e; my
sac: -îki house, hom

source: /her home;
sac: owîki home; his

source: e (an.); (s)
sac: îna that, that on

source: who’s that?
sac: châh îna? (so)

source: e
sac: înâhi over ther

source: ANGUAGE
sac: S L OF THE AUK

source: ost that (aetâthwi
sac: inakimowa c kâshôhêha m

source: (it)’s that color;
sac: inâtêwi

source: what colorthat color
sac: owînethani? inâthowa be

source: her brainhair, hea
sac: owînêtepi his/ -înethani (pl.)

source: (single nînethi ) hair, strao r strand;
sac: -înethi

source: andsent, gone
sac: his/her hair str inêtwa be ab

source: D ICTIONARY
sac: 40 A C ONCISE

source: say to, tellishi! tell him
sac: inêwa n/sh ( ) wîhpîtikêch

source: that’s it!, thaose ones (an
sac: îni! înê! (or ) îniki those, th

source: e I think soat that time,
sac: îni mêkwêh îninâhi then,

source: ose ones (inîni tathwê r
sac: înini those, th îni tathwi (o

source: châh ênownâh y ___?;
sac: ___? tâni (or how do you sa

source: in!
sac: inowêno! say it aga

source: i ) tooow
sac: -îpichi -îpitan (pl.: -îpikani bone marr

source: UAGE
sac: S L OF THE AUK ANG

source: way;
sac: ishawiwa act that

source: re yoîn ês
sac: keteshawi? what a what are you up to?;

source: not upp
sac: êshawiyânini I’m -îshehkwayi scal

source: ave yoonesel
sac: kîhkâshkahone I’ll sh kâshkahowa shave (

source: ar an.
sac: kâshkehtawêwa he

source: before
sac: kashki- can (put right

source: 45 E
sac: S L OF THE AUK ANGUAG

source: buy, eshkih
sac: kashkihêwa acquire, nenatawêneta kîhka

source: inan.;
sac: inan.; acquire, buy, earn

source: shkihive mo
sac: nenatawêneta wîhka kâta not (with Prohibit

source: 47 E
sac: S L OF THE AUK ANGUAG

source: it’s a tornado;
sac: kehchiwâyâthowa kehchiwâyâthowa

source: yêwairst wor
sac: kehchiwâyâthowa p kêhi and, but (follows f

source: pil, studentenâmi-
sac: kêkyêhkimâthochiki ) pu kekyêhtenâmi kekyêht ,

source: thout a
sac: really, definitely, for sure, wi

source: be dim kekyêpeshêwa kep -witted, stupieshêwa ) be
sac: kekyêpâtethiwa

source: enâchslowly
sac: kenâchi kenâchi- k , slowly; kîhthâkiwâtowe please speak

source: cough,
sac: kenîkitêhêwa cough; have a

source: a ticklâchî
sac: kenîkikotâkanwa -/e) ( have Kêtôha Kanakan (or

source: (it) say ketômikatwi? s, mees it
sac: ketômikatwi

source: nê orpeaki
sac: neki! mother’s sister; ( kî’hkâ! oh no! (male s

source: be full Kîkâpôwa (fromo
sac: kîhpochêwa

source: was
sac: kôkenikêwa do the

source: ) wayour
sac: kôkinechêwa â/ê ( kôkinechâno! wash

source: AGE
sac: S L OF THE AUK ANGU

source: g, bul
sac: konwâshkêha fro

source: (Oklbe bo
sac: Koshineki Cushing koshkwâtethiwa

source: yeare )
sac: kotakawahîne last nîkâni kotakawahîn

source: inan
sac: kotaki another, other

source: ) beekot
sac: kothekwanwa -/e ( takâwi k overweight;

source: -dicbe s
sac: kothikêwa play bowl-and kwahkwâpitanekowa

source: out,
sac: kwâshkwithahowa get

source: or, loyou;
sac: kwînomêwa miss; pine f kekwînomene an.; I miss

source: iss yitho I’m
sac: kekwînomenepena we m nemahwêw Wolf clan;

source: /e ) have apotbelly
sac: makânaketonwa - ( makechêwa have a

source: g;
sac: kemakekine you’re bi

source: gg ears
sac: makekinôki they’re bi makeshêwa have bi

source: ( i.e. have been overly we -/e ) haveaned (sai
sac: makinehpetonwa

source: ê ) be growp
sac: makinehpyêwa â/ ( mâkohkwayi hat, ca

source: ; beam;
sac: mehtekwi tree; wood; stick

source: bowlo, colli
sac: mehtekwinâkani wooden mehteshkamwa bump int

source: kiwêwen
sac: mehtôchi meko âkwi pêh kehkênetakini Thâkiwâto

source: 71 E
sac: S L OF THE AUK ANGUAG

source: ashamed,
sac: mêneshitêhêwa be

source: it’s sp ring
sac: menôhkamîwi

source: êkôhi?
sac: kashkimenohkâha k

source: o drink?
sac: could I have something t

source: be a fair deal,
sac: menwakimowa

source: (it)’s a fair deal,
sac: menwakitêwi

source: od eyesigood vision
sac: menwâpiwa have go nemenwâpi I’ve got g

source: ht on timenâhkachi
sac: kwîyena nâhinâhi rig nâhkachi again; and;

source: 81 E
sac: S L OF THE AUK ANGUAG

source: pwa!
sac: nâhkachi kîhnêwone

source: n)
sac: (to more than one perso

source: all (of timeay
sac: nahkani- throughout, nahkanikîshekwi all d

source: leave, afollow
sac: nakanêwa n/sh ( ) nâkanêwa n/sh ( )

source: , guts; ee, stop
sac: -nakeshi intestines nakeshkêwa brak

source: NARY
sac: 82 A C D ONCISE ICTIO

source: (as of a vehicle or ma stop; stchine)
sac: nakithachikêwa

source: an. (a
sac: nakithahêwa stop

source: , leave,
sac: nâkwêwa â/ê ( ) go

source: toen
sac: nîhnâkwâpena we’ve got including the person(s) spok

source: waon
sac: nâkwâno! spoken to); go a namachîneki to the left,

source: e,
sac: nanâhikwêhikêwa driv

source: roosterd an.;
sac: neniwipakahâhkwâha nenohtawêwa understan

source: you;
sac: kenenohtône I understand

source: ’t undeo you
sac: âkwi nenohtônânini I don kenenohtawi? stand you; d

source: i ) cowld
sac: nenothwa nenothôk (pl.: nepachiwa be cold, get co

source: , in thirdhundred
sac: nêthônameki third nethwâhkwe three

source: 89 AGE
sac: S L OF THE AUK ANGU

source: ee yearshree an.
sac: nethwawahîne thr nethwihêwa have t

source: pôtweou later
sac: nêwêwa ka see an.; kîhnêwone I’ll see y

source: nenîchchildren
sac: -nîchânetha child; mâhaki these are my

source: nâhi ) wt year
sac: nikâ’nâhi nikô’ (or nîkânawahîne nex

source: !, what a pity!
sac: ôhwâ! yôhwâ! (or ) man

source: ration, oref
sac: (expresses tiredness, exaspe okimâwa chief, tribal chi

source: nôshithemaani his/her
sac: -ôshithema grandchild; ôshithem my grandchild;

source: ( of a female:) b
sac: oshkashîhkwêwiwa

source: a Shkashale:) be a
sac: netoshkashîhkwêwi I’m oshkashîwiwa (of a ma

source: kâgive
sac: pakithâhkwiwa give up; pakithâhkwihkani! don’t

source: kâtt!
sac: panenamwa drop inan.; panenâhkani! don’t drop i

source: (it) forks pehchimêwa (referringo an. (for
sac: pâthikithenwi

source: (for what I said to you )
sac: sorry

source: rry to an.
sac: pehchitôtawêwa say so

source: itôtôneyou)
sac: kepehch something done); I’m sorry (for what I did to

source: ery; veryspeaking)
sac: pêhki pêhki meko (or ) v pêhkî’hkâ! oh no! (male

source: ht gravykep ng;
sac: pêhkikeshânâpowi lig pehtowêwa be wro

source: ehtowêky, hazy
sac: kep you’re wrong (pl.: pekeshêwi it’s smo

source: o! comeive
sac: pemâkwapin group; pemâtethiwa be al

source: care of inre of an.
sac: pemenamwa take pemenêwa take ca

source: ve lost on
sac: pepeshkwitepêwa ha

source: Y
sac: 104 A C D ONCISE ICTIONAR

source: Orientalovershoe
sac: Pêpîwinîkwâhichiki ) an pepônwimahkethêhi

source: be cut peshikwâchimowa estraightf
sac: peshikâchikiwa

source: elling it aânet
sac: nepeshikwâchimo I’m t netâhe! net daughter(s); (or

source: be inagon
sac: tanwâchipemâtethiwa tâpyâna atâpyâna (or ) w

source: , breeyears
sac: tâthiyâni diapers; loincloth tathwawahîne that many

source: wakihildren
sac: nekotwâshika netathwihâ nenîchânethaki I have six c

source: (s)he’si ayô
sac: nekoti tathwipepônwêwa tawânahi tawânah if only;

source: hope shorse;
sac: tawânahi kêhtena I sure -taya -tayêki (pl.: ) pet, dog,

source: her pet(
sac: netaya otayêni my pet; his/

source: cold mpêhki
sac: têhkyâki miniki ice cream; tepânêwa n/sh ( ) love an.;

source: (s)he loves pêh me;
sac: netepânekwa

source: er a lot;
sac: netepânâwa I love him/h

source: doesn’tnwi-
sac: pashi tepâshichini (s)he tepehkîwi me it’s night;

source: it’s a beautiful n ight;
sac: tepehkîwi

source: it’s the mi kîshinâwitepeh ddle ofkîwi it’s
sac: nâwitepehkîwi

source: (number of years old); êhtêpeshkamani! wikenwbirthday!;
sac: men

source: awahîneturned 40
sac: înoki nyêwâpitaki tathw êhtêpeshkamâni today I

source: that’s) en
sac: têpi têpi- têpi! , enough; (

source: the gratitks; I’m
sac: têpihêwa please an., earn ketêpihi of an.; than

source: rhave h
sac: I’m grateful to him/he têpikîhpochêwa

source: (of anâkani
sac: têpitathwi enough têpitathwi thîweht

source: bicycle,
sac: têtepithâha wheel, tire;

source: adachey
sac: têwehkwêwa have a he thakâki finally; just barel

source: it my
sac: nethakipota nînaniwi I b

source: a Saf Okl
sac: Thâkîwa Othâkîwa (or ) member of the Sac & Fox o

source: Sauk;
sac: thâkiwâtowêwa speak

source: speakwe? c
sac: kethâkiwâtowe? do you kenahithâkiwâto Sauk?;

source: n’t spek, the
sac: thâkiwâtowêyânini I do Thâkiwâtowêweni Sau

source: ri);
sac: Oklahoma or of the Missou

source: uk (or,
sac: nethâkîwipena we’re Sa

source: to:
sac: including the person talked

source: an. (achiw
sac: wâkithahêwa turn wâkîwa nama turn;

source: ! take
sac: mayâwiwâkîno left!;

source: GE
sac: S L OF THE AUK ANGUA

source: be ahith
sac: wâkoshêhithowa newâkoshê Fox clan;

source: îhkedid y
sac: newan of one’s mind; kewanîhke? I forgot;

source: , oloo
sac: wâpamêwa watch wâpamôni mirror,

source: ION
sac: 126 A C D ONCISE ICT

source: Delabe
sac: Wâpanahkîha a wâpânehkwêwa

source: h, oht,
sac: wâpatamwa watc wâpâtêwi (it)’s lig

source: h )
sac: wâpatônêwa n/s (

source: be lig ht,
sac: wâpâthowa

source: it’s fl wâpeshkethiwa urrybe
sac: wâpehpowi

source: be mis
sac: wâwaneshkâhiwa

source: ) eggbolts
sac: wâwani owâwani (or wâwâthêtonôki (pl.)

source: ; mesâkatô
sac: wâwiyâkatôhi things mêmekenano wâwiy

source: an.;
sac: wâwiyâmêwa thank

source: o onewa!
sac: kewâwiyâmene! thanks! (t kewâwiyâmenep person);

source: (to more than one per son)
sac: thanks!

source: used if aou want to
sac: wê! ô! (or ) oh!, hey! (often thought occurs to you, or if y

source: (femalethe north, to
sac: wê! wî! (or ) gosh!, oh my! wêchikethîyâki north, in

source: h, in the west,
sac: wêchinâwahkwêki sout wêchipakishimoki west,

source: it’s wonderful; wêchitawi!
sac: wêchitawi

source: east, to theturn on
sac: wêchiwâpaki east, in the wêpwêwêkihêwa

source: Puebloeast, t
sac: Wêtahpahônîha a wêtapaki east, in the

source: be b wêwenetwi eautiful
sac: wêwenethiwa

source: , headd
sac: wêwêpenôni roach

source: 1 GE
sac: S L OF THE AUK ANGUA

source: ment agmpany
sac: wêyôthêha govern wîchi- together, in co
